1) The provided data (link above) contains various details and attributes associated with used cars. The target variable, which is the central focus of analysis, is the price of the used cars, and it is measured in lakhs. The data in this dataset is tabular, with rows and columns, where each row represents a specific used car listing, and each column represents a particular attribute or feature of these cars. Features are Make and model of the car, Location or city of sale, Year of manufacture, Mileage, Odometer (kilometers driven), Fuel type (petrol or diesel), Transmission type (manual or automatic), Number of owners, Engine displacement, Engine horsepower, Number of seats, and Price when the car was new. Use this data to perform the following:

**IMPORT LIBRARIES**

In [52]:
import pandas as pd
import numpy as np

**LOAD DATA**

In [53]:
df = pd.read_csv("used_cars.csv")

In [54]:
print("First 5 rows:")
print(df.head())

First 5 rows:
   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage   Engine  \
0              41000    Diesel       Manual      First  19.67 kmpl  1582 CC
1              46000    Petrol       Manual      First    13 km/kg  1199 CC
2              87000    Diesel       Manual      First  20.77 kmpl  1248 CC
3              40670    Diesel    Automatic     Second   15.2 kmpl  1968 CC
4              86999    Diesel       Manual      First  23.08 kmpl  1461 CC

       Power  Seats  New_Price  Price
0  126.2 bhp    5.0        NaN  12.50
1   88.7 bhp    5.0  8.61 Lakh   4.50
2  88.76 bhp    7.0        NaN   6.00
3  140.8 bhp    5.0        NaN  17.74
4   63.1 bhp    5.0        NaN   3.50

In [55]:

print("\nColumn info:")
print(df.info())

Column info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5847 entries, 0 to 5846
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         5847 non-null   int64
 1   Name               5847 non-null   object
 2   Location           5847 non-null   object
 3   Year               5847 non-null   int64
 4   Kilometers_Driven  5847 non-null   int64
 5   Fuel_Type          5847 non-null   object
 6   Transmission       5847 non-null   object
 7   Owner_Type         5847 non-null   object
 8   Mileage            5845 non-null   object
 9   Engine             5811 non-null   object
 10  Power              5811 non-null   object
 11  Seats              5809 non-null   float64
 12  New_Price          815 non-null    object
 13  Price              5847 non-null   float64
dtypes: float64(2), int64(3), object(9)
memory usage: 639.6+ KB
None

# **a) Look for the missing values in all the columns and either impute the(replace with mean, median, or mode) or drop them. Justify your action for this task.**

For numerical columns (e.g., Year, Mileage, Engine, Power, Price, New_price, etc.),
→ using median to fill missing values

For categorical columns (e.g., Fuel_Type, Transmission, Location, etc.),
→ using mode

This keeps all rows instead of dropping useful data.

 **1. Checking missing values per column BEFORE**

In [56]:
print("\nMissing values per column BEFORE handling:")
print(df.isna().sum())

Missing values per column BEFORE handling:
Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

**2. Separating numerical and categorical columns**

In [57]:
numeric_cols = df.select_dtypes(include=["int64", "float64"]).columns
categorical_cols = df.select_dtypes(include=["object"]).columns

**3. Impute numeric columns with median**

In [58]:
for col in numeric_cols:
    median_value = df[col].median()
    df[col].fillna(median_value, inplace=True)

/tmp/ipython-input-271013490.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(median_value, inplace=True)

**4. Impute categorical columns with mode**

In [59]:
for col in categorical_cols:
    mode_value = df[col].mode()
    if len(mode_value) > 0:
        df[col].fillna(mode_value[0], inplace=True)

/tmp/ipython-input-3099125227.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(mode_value[0], inplace=True)

**5. Checking missing values AFTER**

In [60]:
print("\nMissing values per column AFTER handling:")
print(df.isna().sum())

Missing values per column AFTER handling:
Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
New_Price            0
Price                0
dtype: int64

# **b) Remove the units from some of the attributes and only keep the numerical values (for example remove kmpl from “Mileage”, CC from “Engine",bhp from “Power”, and lakh from “New_price”).**

Removing units and keep only numeric values

**1. Mileage (kmpl)**

In [61]:
if "Mileage" in df.columns:
    df["Mileage"] = (
        df["Mileage"]
        .astype(str)
        .str.extract(r"([\d\.]+)", expand=False)
        .astype(float)
    )

**2. Engine (CC)**

In [62]:
if "Engine" in df.columns:
    df["Engine"] = (
        df["Engine"]
        .astype(str)
        .str.extract(r"([\d\.]+)", expand=False)
        .astype(float)
    )

**3. Power (bhp)**

In [63]:
if "Power" in df.columns:
    df["Power"] = (
        df["Power"]
        .astype(str)
        .str.extract(r"([\d\.]+)", expand=False)
        .astype(float)
    )

**4. New_price (Lakh)**

In [69]:
if "New_Price" in df.columns:
    df["New_Price"] = (
        df["New_Price"]
        .astype(str)
        .str.extract(r"([\d\.]+)", expand=False)
        .astype(float)
    )

In [70]:
print("\nAfter removing units, sample rows:")
cols_to_show = [c for c in ["Mileage", "Engine", "Power", "New_Price"] if c in df.columns]
if cols_to_show:
    print(df[cols_to_show].head())

After removing units, sample rows:
   Mileage  Engine   Power  New_Price
0    19.67  1582.0  126.20       4.78
1    13.00  1199.0   88.70       8.61
2    20.77  1248.0   88.76       4.78
3    15.20  1968.0  140.80       4.78
4    23.08  1461.0   63.10       4.78

## **C) Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot encoded value.**

In [71]:
categorical_to_encode = []
for c in ["Fuel_Type", "Transmission"]:
    if c in df.columns:
        categorical_to_encode.append(c)

In [72]:
df_encoded = pd.get_dummies(df, columns=categorical_to_encode, drop_first=True)

In [76]:
print("\nColumns after one-hot encoding:")
print(df_encoded.columns)

Columns after one-hot encoding:
Index(['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven',
       'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats', 'New_Price',
       'Price', 'Fuel_Type_Electric', 'Fuel_Type_Petrol',
       'Transmission_Manual'],
      dtype='object')

In [78]:
print("\nSample rows after one-hot encoding:")
print(df_encoded.head())

Sample rows after one-hot encoding:
   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0              41000      First    19.67  1582.0  126.20    5.0       4.78
1              46000      First    13.00  1199.0   88.70    5.0       8.61
2              87000      First    20.77  1248.0   88.76    7.0       4.78
3              40670     Second    15.20  1968.0  140.80    5.0       4.78
4              86999      First    23.08  1461.0   63.10    5.0       4.78

   Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual
0  12.50               False             False                 True
1   4.50               False              True                 True
2   6.00               False             False                 True
3  17.74               False             False                False
4   3.50               False             False                 True

**d) Create one more feature and add this column to the dataset (you can use mutate function in R for this). For example, you can calculate the current age of the car by subtracting “Year” value from the current year.**

Creating a new feature (Car_Age)

In [79]:
current_year = pd.Timestamp.now().year  # automatically gets current year

if "Year" in df_encoded.columns:
    df_encoded["Car_Age"] = current_year - df_encoded["Year"]
    print("\nSample of Year and Car_Age:")
    print(df_encoded[["Year", "Car_Age"]].head())

Sample of Year and Car_Age:
   Year  Car_Age
0  2015       10
1  2011       14
2  2012       13
3  2013       12
4  2013       12

# **e) Perform select, filter, rename, mutate, arrange and summarize with group by operations (or their equivalent operations in python) on this dataset.**

**(e1) SELECT – choose columns**

In [82]:
select_cols = [c for c in ["Name", "Location", "Year",
                           "Price", "Mileage", "Fuel_Type_Petrol"] if c in df_encoded.columns]

In [83]:
df_selected = df_encoded[select_cols]

print("\nSELECT example (first 5 rows):")
print(df_selected.head())

SELECT example (first 5 rows):
                               Name    Location  Year  Price  Mileage  \
0  Hyundai Creta 1.6 CRDi SX Option        Pune  2015  12.50    19.67
1                      Honda Jazz V     Chennai  2011   4.50    13.00
2                 Maruti Ertiga VDI     Chennai  2012   6.00    20.77
3   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013  17.74    15.20
4            Nissan Micra Diesel XV      Jaipur  2013   3.50    23.08

   Fuel_Type_Petrol
0             False
1              True
2             False
3             False
4             False

**(e2) FILTER – keep only some rows**

In [84]:

if "Price" in df_encoded.columns and "Year" in df_encoded.columns:
    df_filtered = df_encoded[(df_encoded["Price"] > 5) & (df_encoded["Year"] >= 2015)]
    print("\nFILTER example (Price > 5 lakhs and Year >= 2015):")
    print(df_filtered.head())

FILTER example (Price > 5 lakhs and Year >= 2015):
    Unnamed: 0                               Name Location  Year  \
0            1   Hyundai Creta 1.6 CRDi SX Option     Pune  2015
5            7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
8           10                   Maruti Ciaz Zeta    Kochi  2018
10          12              Maruti Swift VDI BSIV   Jaipur  2015
14          16              Honda Amaze S i-Dtech    Kochi  2016

    Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0               41000      First    19.67  1582.0  126.20    5.0       4.78
5               36000      First    11.36  2755.0  171.50    8.0      21.00
8               25692      First    21.56  1462.0  103.25    5.0      10.65
10              64424      First    25.20  1248.0   74.00    5.0       4.78
14              58950      First    25.80  1498.0   98.60    5.0       4.78

    Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual  Car_Age
0   12.50               False             False                 True       10
5   17.50               False             False                False        9
8    9.95               False              True                 True        7
10   5.60               False             False                 True       10
14   5.40               False             False                 True        9

**(e3) RENAME – change a column name**

In [85]:
if "Price" in df_encoded.columns:
    df_renamed = df_encoded.rename(columns={"Price": "Price_Lakh"})
    print("\nRENAME example (Price -> Price_Lakh):")
    print(df_renamed[["Price_Lakh"]].head())

RENAME example (Price -> Price_Lakh):
   Price_Lakh
0       12.50
1        4.50
2        6.00
3       17.74
4        3.50

**(e4) MUTATE – create a new derived column**

In [93]:

km_col = "Kilometers_Driven"

if km_col in df_encoded.columns and "Price" in df_encoded.columns:
    df_mutated = df_encoded.copy()

    # Price is in lakhs -> convert to rupees (× 1e5), then divide by kilometers driven
    df_mutated["Price_per_km"] = df_mutated["Price"] * 1e5 / df_mutated[km_col]

    print("\nMUTATE example (Price_per_km):")
    # Tabular output of the first 5 rows
    print(df_mutated[[km_col, "Price", "Price_per_km"]].head())
else:
    print("Either 'Kilometers_Driven' or 'Price' column not found in df_encoded.")

MUTATE example (Price_per_km):
   Kilometers_Driven  Price  Price_per_km
0              41000  12.50     30.487805
1              46000   4.50      9.782609
2              87000   6.00      6.896552
3              40670  17.74     43.619375
4              86999   3.50      4.023035

**(e5) ARRANGE – sort rows**

In [94]:

if "Price" in df_encoded.columns:
    df_arranged = df_encoded.sort_values(by=["Price"], ascending=False)
    print("\nARRANGE example (sorted by Price descending):")
    print(df_arranged[["Price"]].head())

ARRANGE example (sorted by Price descending):
       Price
3952  160.00
5620  120.00
5752  100.00
1457   97.07
1917   93.67

**(e6) SUMMARIZE with GROUP BY**

In [95]:

if "Fuel_Type" in df.columns and "Price" in df.columns:
    summary = (
        df.groupby("Fuel_Type")["Price"]
          .agg(["count", "mean", "min", "max"])
          .reset_index()
    )
    print("\nSUMMARIZE with GROUP BY example (by Fuel_Type):")
    print(summary)

SUMMARIZE with GROUP BY example (by Fuel_Type):
  Fuel_Type  count       mean    min    max
0    Diesel   3161  12.960686   0.60  160.0
1  Electric      2  12.875000  12.75   13.0
2    Petrol   2684   5.756688   0.44  120.0